driver-tests/bpelse/dynamicpartnerlink/correlation/correlationJbi/test/corrInvOnMsgParentW1I6_Correlation/Input1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="corrInvOnMsgParent">
  <soapenv:Body>
    <inv:corrInvOnMsgParentElement>
      <inv:string>input</inv:string>
    </inv:corrInvOnMsgParentElement>
  </soapenv:Body>
</soapenv:Envelope>